<?php

return array(

	/*
	|--------------------------------------------------------------------------
	| type2name
	|--------------------------------------------------------------------------
	| 
	| 類型號碼 => 類型完整名稱
	| 
	*/

	'type2name' => array(
		0 => '學生會會長',
		1 => '學生會副會長',
		2 => '學生代表',
		3 => '系總幹事',
	),

	/*
	|--------------------------------------------------------------------------
	| depart_code2name
	|--------------------------------------------------------------------------
	| 
	| 系所的號碼 => 系所的中文完整名稱
	| 
	*/

	'depart_code2name' => array(
		'' => '',
	),
	
	/*
	|--------------------------------------------------------------------------
	| uploaded_photo_folder
	|--------------------------------------------------------------------------
	| 
	| 照片上傳之後的存放位置，請對照 app_const.php 內的 PhotoLocation
	| 
	*/

	'uploaded_photo_folder' => '/img/upload/',

	/*
	|--------------------------------------------------------------------------
	| PhotoTempLocation
	|--------------------------------------------------------------------------
	| 
	| 照片暫時放置的位置，最後必須要有"/"，請對照 app_const.php 內的 PhotoLocation
	| 
	*/

	'PhotoTempLocation' => "/img/upload/temp/",

	/*
	|--------------------------------------------------------------------------
	| sex2string
	|--------------------------------------------------------------------------
	| 
	| 照片上傳之後的存放位置，請對照 app_const.php 內的 PhotoLocation
	| 
	*/

	'sex2string' => array(
		'女','男'
	),

	/*
	|--------------------------------------------------------------------------
	| photo_error_message_prefix
	|--------------------------------------------------------------------------
	| 
	| 圖片上傳錯誤的錯誤訊息
	| 
	*/

	'photo_error_message_prefix' => '錯誤：',

	/*
	|--------------------------------------------------------------------------
	| col2name
	|--------------------------------------------------------------------------
	| 
	| 資料庫、填寫欄位變數對應中文名稱
	| 
	*/

	'col2name' => array(
	    'id'            => '哀低',
	    'regis_type'    => '候選人類別',
	    'type_data'     => '詳細資料',
	    'name'          => '姓名',
	    'sex'           => '性別',
	    'depart'        => '系級',
	    'grade'         => '年級',
	    'exp'           => '經歷',
	    'politics'      => '政見',
	    'phone'         => '電話號碼',
	    'email'         => '電子信箱',
	    'agree'         => '同意與否',
	    'code'          => '修改碼',
	    'photo'         => '照片',
	),

	/*
	|--------------------------------------------------------------------------
	| fieldDocExample
	|--------------------------------------------------------------------------
	| 
	| 每個欄位的詳細說明
	| 
	*/

	'fieldDocExample' => array(
	    'photo'    => '請點選按鈕上傳大頭貼，以看得清楚臉之大頭照為主，並且只接受不超過 100KB 之 jpg,jpeg,png 圖片檔案',
	    'name'     => '姓名',
	    'sex'      => '請選擇男(左)或是女(右)',
	    'depart'   => '系級，包含「學系完整名稱」和「幾年」級，例如：資訊科學與工程學系105級',
	    'exp'      => '經歷，兩個至三百字之間',
	    'politics' => '政見，兩個至三百字之間',
	    'phone'    => '聯絡電話，共10碼，例如：0412345678、0912345678',
	    'email'    => '常用電子信箱',
	    'agree'    => '請詳細閱讀個人資料提供同意書並勾選同意',
	),

	/*
	|--------------------------------------------------------------------------
	| showingDelayTimeout
	|--------------------------------------------------------------------------
	| 
	| js 進行載入選舉人時，每個 block 排版出現的延遲 (毫秒)
	| 
	*/

	'showingDelayTimeout' => 300,

	/*
	|--------------------------------------------------------------------------
	| moving_inteval
	|--------------------------------------------------------------------------
	| 
	| 滑動時持續的時間長度 (毫秒)
	| 
	*/

	'moving_inteval' => 500,
);

